# Pandas Practice Worksheet: From Data Frames to Feature Engineering

## Section 1: The Basics - Series

A `Series` is a one-dimensional labeled array, like a single column of a spreadsheet.

### 1. Import the pandas library as pd and numpy as np.

In [1]:
import pandas as pd
import numpy as np

### 2. Create a Pandas Series named `my_series` from the list `[10, 20, 30, 40, 50]`.

In [2]:
my_series = pd.Series([10, 20, 30, 40, 50])
my_series

0    10
1    20
2    30
3    40
4    50
dtype: int64

### 3. Create a Series named `fruit_series` from the list `['apple', 'banana', 'cherry']` with a custom index of `['a', 'b', 'c']`.

In [3]:
fruit_series = pd.Series(['apple', 'banana', 'cherry'],index=['a', 'b', 'c'])
fruit_series

a     apple
b    banana
c    cherry
dtype: object

### 4. From `fruit_series`, select the element with the index label 'b'.

In [4]:
fruit_series['b']

'banana'

### 5. Create a Series named `scores` from the dictionary `{ 'Math': 90, 'History': 85, 'Science': 92}`.

In [5]:
score_dict = { 'Math': 90, 'History': 85, 'Science': 92}
scores = pd.Series(score_dict)
scores

Math       90
History    85
Science    92
dtype: int64

### 6. Using `scores`, select all scores that are greater than 88.

In [6]:
scores[scores > 88]

Math       90
Science    92
dtype: int64

## Section 2: The Basics - DataFrame

A `DataFrame` is a two-dimensional labeled data structure, like a full spreadsheet.

### 7. Generate Data: Create a dictionary named `student_data` with the following data:
  `'Name': ['Alice', 'Bob', 'Charlie', 'David', 'Emily']`
  `'Age': [21, 22, 21, 23, 22]`
  `'Major': ['Physics', 'Chemistry', 'Physics', 'Math', 'Chemistry']`
  `'Score': [85, 92, 78, 95, 88]`

In [7]:
student_data = {
    'Name': ['Alice', 'Bob', 'Charlie', 'David', 'Emily'],
    'Age': [21, 22, 21, 23, 22],
    'Major': ['Physics', 'Chemistry', 'Physics', 'Math', 'Chemistry'],
    'Score': [85, 92, 78, 95, 88]
}

### 8. Create a DataFrame named `student_df` from the `student_data` dictionary.

In [8]:
student_df = pd.DataFrame(student_data)
student_df

      Name  Age      Major  Score
0    Alice   21    Physics     85
1      Bob   22  Chemistry     92
2  Charlie   21    Physics     78
3    David   23       Math     95
4    Emily   22  Chemistry     88

### 9. Display the first 5 rows of `student_df`.

In [9]:
student_df.head(5)

      Name  Age      Major  Score
0    Alice   21    Physics     85
1      Bob   22  Chemistry     92
2  Charlie   21    Physics     78
3    David   23       Math     95
4    Emily   22  Chemistry     88

### 10. Display the last 3 rows of `student_df`.

In [10]:
student_df.tail(3)

      Name  Age      Major  Score
2  Charlie   21    Physics     78
3    David   23       Math     95
4    Emily   22  Chemistry     88

### 11. Get a quick summary of `student_df`, including data types and non-null counts.

**Hint:** Use `.info()`.

In [11]:
student_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    5 non-null      object
 1   Age     5 non-null      int64
 2   Major   5 non-null      object
 3   Score   5 non-null      int64
dtypes: int64(2), object(2)
memory usage: 292.0+ bytes

### 12. Get a statistical summary (mean, std, etc.) of the numerical columns in `student_df`.

**Hint:** Use `.describe()`.

In [12]:
student_df.describe()

            Age      Score
count   5.00000   5.000000
mean   21.80000  87.600000
std     0.83666   6.580274
min    21.00000  78.000000
25%    21.00000  85.000000
50%    22.00000  88.000000
75%    22.00000  92.000000
max    23.00000  95.000000

### 13. Display just the column names of `student_df`.

In [13]:
student_df.columns

Index(['Name', 'Age', 'Major', 'Score'], dtype='object')

### 14. Display the 'shape' (rows, columns) of `student_df`.

In [14]:
student_df.shape

(5, 4)

## Section 3: Data Loading (Your Choice)

You now have a choice. You can continue with the `student_df` you just made, OR (recommended) you can load a real-world dataset. The following questions will refer to `df`. You can set `df = student_df` or `df = titanic_df`.

### 15. (Recommended) Load a real-world dataset. Let's use the Titanic dataset.
  `data_url = 'https://calmcode.io/static/data/titanic.csv'`
  Read this CSV from the URL into a new DataFrame called `titanic_df`.
  Set `df = titanic_df`.

In [15]:
df = pd.read_csv(r"datasets/Titanic-Dataset.csv")

### 16. Display the `head()` of your chosen `df`.

In [16]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

### 17. Check the `dtypes` of all columns in `df`.

In [17]:
df.dtypes

PassengerId      int64
Survived         int64
Pclass           int64
Name            object
Sex             object
Age            float64
SibSp            int64
Parch            int64
Ticket          object
Fare           float64
Cabin           object
Embarked        object
dtype: object

## Section 4: Selection & Indexing (The Core)

Use your chosen `df` for this section.

### 18. Select and display only the 'Age' column.

In [18]:
df['Age'].head()

0    22.0
1    38.0
2    26.0
3    35.0
4    35.0
Name: Age, dtype: float64

### 19. Select and display both the 'Age' and 'Sex' columns.

**Hint:** Use a list `[]` inside the `[]`.

In [19]:
df[["Age","Sex"]].head()

    Age     Sex
0  22.0    male
1  38.0  female
2  26.0  female
3  35.0  female
4  35.0    male

### 20. `.iloc` (Integer Location): Select the first 5 rows of the DataFrame.

In [20]:
df.iloc[0:5]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

### 21. `.iloc`: Select the row at index 3.

In [21]:
df.iloc[3]

PassengerId                                               4
Survived                                                  1
Pclass                                                    1
Name           Futrelle, Mrs. Jacques Heath (Lily May Peel)
Sex                                                  female
Age                                                    35.0
SibSp                                                     1
Parch                                                     0
Ticket                                               113803
Fare                                                   53.1
Cabin                                                  C123
Embarked                                                  S
Name: 3, dtype: object

### 22. `.iloc`: Select rows at index 1, 3, and 5, and columns at index 0, 2, and 4.

In [22]:
df.iloc[[1,3,5],[0,2,4]]

   PassengerId  Pclass     Sex
1            2       1  female
3            4       1  female
5            6       3    male

### 23. `.loc` (Label Location): Select the row with the index label 3.

**Note:** this is different from `.iloc[3]` if the index isn't 0, 1, 2...

In [23]:
df.loc[3]

PassengerId                                               4
Survived                                                  1
Pclass                                                    1
Name           Futrelle, Mrs. Jacques Heath (Lily May Peel)
Sex                                                  female
Age                                                    35.0
SibSp                                                     1
Parch                                                     0
Ticket                                               113803
Fare                                                   53.1
Cabin                                                  C123
Embarked                                                  S
Name: 3, dtype: object

### 24. `.loc`: Select all rows from index 0 to 10 (inclusive) and only the 'Age' and 'Fare' columns.

In [24]:
df.loc[0:10,['Age','Fare']]

     Age     Fare
0   22.0   7.2500
1   38.0  71.2833
2   26.0   7.9250
3   35.0  53.1000
4   35.0   8.0500
5    NaN   8.4583
6   54.0  51.8625
7    2.0  21.0750
8   27.0  11.1333
9   14.0  30.0708
10   4.0  16.7000

### 25. Conditional Selection: Select all rows where the 'Age' is greater than 30.

In [25]:
df.loc[df['Age']>30]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
6,7,0,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,17463,51.8625,E46,S
11,12,1,1,"Bonnell, Miss. Elizabeth",female,58.0,0,0,113783,26.5500,C103,S
...,...,...,...,...,...,...,...,...,...,...,...,...
873,874,0,3,"Vander Cruyssen, Mr. Victor",male,47.0,0,0,345765,9.0000,NaN,S
879,880,1,1,"Potter, Mrs. Thomas Jr (Lily Alexenia Wilson)",female,56.0,0,1,11767,83.1583,C50,C
881,882,0,3,"Markun, Mr. Johann",male,33.0,0,0,349257,7.8958,NaN,S
885,886,0,3,"Rice, Mrs. William (Margaret Norton)",female,39.0,0,5,382652,29.1250,NaN,Q
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

### 26. Complex Condition: Select all rows where 'Sex' is 'female' AND 'Age' is less than 18.

In [26]:
df.loc[(df['Sex'] == 'female') & (df['Age'] < 18)].head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
9,10,1,2,"Nasser, Mrs. Nicholas (Adele Achem)",female,14.0,1,0,237736,30.0708,NaN,C
10,11,1,3,"Sandstrom, Miss. Marguerite Rut",female,4.0,1,1,PP 9549,16.7000,G6,S
14,15,0,3,"Vestrom, Miss. Hulda Amanda Adolfina",female,14.0,0,0,350406,7.8542,NaN,S
22,23,1,3,"McGowan, Miss. Anna ""Annie""",female,15.0,0,0,330923,8.0292,NaN,Q
24,25,0,3,"Palsson, Miss. Torborg Danira",female,8.0,3,1,349909,21.0750,NaN,S

### 27. `.isin()`: Select all rows where the 'Embarked' port is 'C' or 'Q'.

**Hint:** Use `.isin(['C', 'Q'])`.

In [27]:
df.isin(['C','Q']).head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,False,False,False,False,False,False,False,False,False,False,False,False
1,False,False,False,False,False,False,False,False,False,False,False,True
2,False,False,False,False,False,False,False,False,False,False,False,False
3,False,False,False,False,False,False,False,False,False,False,False,False
4,False,False,False,False,False,False,False,False,False,False,False,False

### 28. Set the 'PassengerId' column as the new index for the DataFrame.

**Hint:** Do this *not* in-place, and assign it to `df_indexed`.

In [28]:
df_indexed = pd.DataFrame(df,index=df['PassengerId'])
df_indexed.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
PassengerId,,,,,,,,,,,,
1,2.0,1.0,1.0,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1.0,0.0,PC 17599,71.2833,C85,C
2,3.0,1.0,3.0,"Heikkinen, Miss. Laina",female,26.0,0.0,0.0,STON/O2. 3101282,7.9250,NaN,S
3,4.0,1.0,1.0,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1.0,0.0,113803,53.1000,C123,S
4,5.0,0.0,3.0,"Allen, Mr. William Henry",male,35.0,0.0,0.0,373450,8.0500,NaN,S
5,6.0,0.0,3.0,"Moran, Mr. James",male,NaN,0.0,0.0,330877,8.4583,NaN,Q

## Section 5: Data Cleaning

This section is crucial for ML. Use the `titanic_df` for these questions, as `student_df` has no missing data.

### 29. Check how many missing (NaN) values are in each column of the `df`.

**Hint:** Use `.isnull().sum()`.

In [29]:
df.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

### 30. What is the total number of missing values in the entire DataFrame?

In [30]:
print("Total Missing Values in the entire Data Frame = ",df.isnull().sum().sum())

Total Missing Values in the entire Data Frame =  866